In [1]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse data structures: Series and DataFrame

## Series

A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [2]:
obj = pd.Series([4, 5, 6, 7, 8])

In [3]:
obj

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [4]:
obj.values

array([4, 5, 6, 7, 8], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
obj2 = pd.Series(data = [4, 5, 6, 7, 8], index = ['a', 'b', 'c', 'd', 'e'])

In [7]:
obj2

a    4
b    5
c    6
d    7
e    8
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [9]:
obj2['b']

5

In [10]:
obj2['c'] = 98

In [11]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [12]:
obj2[['a', 'b', 'c']]

a     4
b     5
c    98
dtype: int64

In [13]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [14]:
obj2 > 5

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [15]:
obj2[obj2 > 5]

c    98
d     7
e     8
dtype: int64

In [16]:
obj2 * 2

a      8
b     10
c    196
d     14
e     16
dtype: int64

In [17]:
obj2 ** 2

a      16
b      25
c    9604
d      49
e      64
dtype: int64

In [18]:
np.exp(obj2)

a    5.459815e+01
b    1.484132e+02
c    3.637971e+42
d    1.096633e+03
e    2.980958e+03
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dict

In [19]:
obj2

a     4
b     5
c    98
d     7
e     8
dtype: int64

In [20]:
'd' in obj2

True

In [21]:
'g' not in obj2

True

In [22]:
dict_data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
dict_data

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = pd.Series(data = dict_data)

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states = ['California', 'Oregon', 'Ohio', 'Utah']

In [27]:
states

['California', 'Oregon', 'Ohio', 'Utah']

In [28]:
obj4 = pd.Series(data = dict_data, index = states)

In [29]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [30]:
pd.isnull(obj4)

California     True
Oregon        False
Ohio          False
Utah          False
dtype: bool

In [31]:
pd.notnull(obj4)

California    False
Oregon         True
Ohio           True
Utah           True
dtype: bool

In [32]:
pd.notna(obj4)

California    False
Oregon         True
Ohio           True
Utah           True
dtype: bool

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [35]:
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon        32000.0
Texas             NaN
Utah          10000.0
dtype: float64

A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations

In [36]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
Name: population, dtype: float64

In [39]:
obj4.index.name = 'states'

In [40]:
obj4

states
California        NaN
Oregon        16000.0
Ohio          35000.0
Utah           5000.0
Name: population, dtype: float64

In [41]:
obj

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [42]:
obj.index = ['bob', 'smith', 'ali', 'dan', 'hud']

In [43]:
obj

bob      4
smith    5
ali      6
dan      7
hud      8
dtype: int64

A Series’s index can be altered in-place by assignment

## DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).

The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index.

In [44]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [45]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
df.head() #head() selects only the first five rows, used for larger df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [49]:
pd.DataFrame(data=data, columns=['pop', 'state', 'year'])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

If you pass a column that isn’t contained in the dict, it will appear with missing values in the result

In [50]:
df2 = pd.DataFrame(data, columns=['pop', 'state', 'year', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])

In [51]:
df2

       pop   state  year debt
one    1.5    Ohio  2000  NaN
two    1.7    Ohio  2001  NaN
three  3.6    Ohio  2002  NaN
four   2.4  Nevada  2001  NaN
five   2.9  Nevada  2002  NaN
six    3.2  Nevada  2003  NaN

In [52]:
df2.columns

Index(['pop', 'state', 'year', 'debt'], dtype='object')

In [53]:
df2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

In [54]:
df2['year'] #More conventional one to select columns from df

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [55]:
df2.year #if method name and column name would be same then calamity will be upon us

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
df2.loc['three'] #To select rows from df use loc for user choosen index or iloc for default integer index

pop       3.6
state    Ohio
year     2002
debt      NaN
Name: three, dtype: object

In [57]:
df2.iloc[2]

pop       3.6
state    Ohio
year     2002
debt      NaN
Name: three, dtype: object

In [58]:
df2

       pop   state  year debt
one    1.5    Ohio  2000  NaN
two    1.7    Ohio  2001  NaN
three  3.6    Ohio  2002  NaN
four   2.4  Nevada  2001  NaN
five   2.9  Nevada  2002  NaN
six    3.2  Nevada  2003  NaN

In [59]:
df2['debt'] = np.mean(df['pop'])

In [60]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000  2.55
two    1.7    Ohio  2001  2.55
three  3.6    Ohio  2002  2.55
four   2.4  Nevada  2001  2.55
five   2.9  Nevada  2002  2.55
six    3.2  Nevada  2003  2.55

In [61]:
df2['debt'] = np.arange(6.0)

In [62]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   0.0
two    1.7    Ohio  2001   1.0
three  3.6    Ohio  2002   2.0
four   2.4  Nevada  2001   3.0
five   2.9  Nevada  2002   4.0
six    3.2  Nevada  2003   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any holes

In [63]:
col = pd.Series(data=[-1.5, 4.56, -8.5], index=['two', 'three', 'six'])

In [64]:
col

two     -1.50
three    4.56
six     -8.50
dtype: float64

In [65]:
df2['debt'] = col

In [66]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

In [67]:
df2.notna()

        pop  state  year   debt
one    True   True  True  False
two    True   True  True   True
three  True   True  True   True
four   True   True  True  False
five   True   True  True  False
six    True   True  True   True

In [68]:
df2['eastern'] = df2['state'] == 'Ohio'

In [69]:
df2

       pop   state  year  debt  eastern
one    1.5    Ohio  2000   NaN     True
two    1.7    Ohio  2001 -1.50     True
three  3.6    Ohio  2002  4.56     True
four   2.4  Nevada  2001   NaN    False
five   2.9  Nevada  2002   NaN    False
six    3.2  Nevada  2003 -8.50    False

New columns cannot be created with the df2.eastern syntax

In [70]:
df2

       pop   state  year  debt  eastern
one    1.5    Ohio  2000   NaN     True
two    1.7    Ohio  2001 -1.50     True
three  3.6    Ohio  2002  4.56     True
four   2.4  Nevada  2001   NaN    False
five   2.9  Nevada  2002   NaN    False
six    3.2  Nevada  2003 -8.50    False

In [71]:
del df2['eastern'] #deletes column permenantly

In [72]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

Another common form of data is a nested dict of dicts

In [73]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [74]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices

In [75]:
df4 = pd.DataFrame(pop, index=[2000,2001,2002])

In [76]:
df4

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array

In [77]:
df4.transpose()

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [78]:
df4.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [79]:
dict_df = {'Ohio': df4['Ohio'][:-1], 'Nevada': df4['Nevada'][:-1]}

In [80]:
pd.DataFrame(dict_df, columns=['Nevada', 'Ohio'])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [81]:
df4

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [82]:
df4.index.name = 'Year'
df4.columns.name = "States"

In [83]:
df4

States  Nevada  Ohio
Year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [84]:
df4.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [85]:
df2

       pop   state  year  debt
one    1.5    Ohio  2000   NaN
two    1.7    Ohio  2001 -1.50
three  3.6    Ohio  2002  4.56
four   2.4  Nevada  2001   NaN
five   2.9  Nevada  2002   NaN
six    3.2  Nevada  2003 -8.50

In [86]:
df2.values

array([[1.5, 'Ohio', 2000, nan],
       [1.7, 'Ohio', 2001, -1.5],
       [3.6, 'Ohio', 2002, 4.56],
       [2.4, 'Nevada', 2001, nan],
       [2.9, 'Nevada', 2002, nan],
       [3.2, 'Nevada', 2003, -8.5]], dtype=object)

*Table 5-1. Possible data inputs to DataFrame constructor*

![Possible data inputs to DataFrame constructor](Img/5.1.png)

## Index Objects

In [87]:
obj = pd.Series(data=range(3), index=['a', 'b', 'c'])

In [88]:
obj

a    0
b    1
c    2
dtype: int64

In [89]:
index = obj.index

In [90]:
index

Index(['a', 'b', 'c'], dtype='object')

In [91]:
index[:-1]

Index(['a', 'b'], dtype='object')

Index objects are immutable and thus can’t be modified by the user

In [92]:
index[2]

'c'

In [93]:
"index[2] = 'z'" #Type Error

"index[2] = 'z'"

Immutability makes it safer to share Index objects among data structures

In [94]:
labels = pd.Index(np.arange(3))

In [95]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [96]:
obj2 = pd.Series([1.5, -6.5, +7.4], index=labels)

In [97]:
obj2

0    1.5
1   -6.5
2    7.4
dtype: float64

In [98]:
obj2.index is labels

True

In [99]:
df4

States  Nevada  Ohio
Year
2000       NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [100]:
df4.columns

Index(['Nevada', 'Ohio'], dtype='object', name='States')

In [101]:
'Nevada' in df4.columns

True

In [102]:
2003 in df4.columns

False

Unlike Python sets, a pandas Index can contain duplicate labels

In [103]:
dup_index = pd.Index(['a', 'a', 'b', 'c' ])

In [104]:
ser1 = pd.Series(data=[1, 2, 2, 5], index=dup_index)
ser1

a    1
a    2
b    2
c    5
dtype: int64

Selections with duplicate labels will select all occurrences of that label

In [105]:
ser1['a'][0]

1

In [106]:
ser1['a'][1]

2

*See Table 5-2 for some Index methods and properties*

![Index methods and properties](Img/5.2.png)

# 5.2 Essential Functionality

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index

In [107]:
obj = pd.Series(data=[5.4, -8.5, 45.23, 1.2], index=['d', 'a', 'c', 'b'])

In [108]:
obj

d     5.40
a    -8.50
c    45.23
b     1.20
dtype: float64

In [109]:
obj2 = obj.reindex(index=['a', 'b', 'c', 'd', 'e'])

In [110]:
obj2

a    -8.50
b     1.20
c    45.23
d     5.40
e      NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or fill‐
ing of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values

In [111]:
obj3 = pd.Series(data=[1.5, 2.5, 5], index=[2, 3, 5])

In [112]:
obj3

2    1.5
3    2.5
5    5.0
dtype: float64

In [113]:
obj3.reindex(index=range(6), method='ffill')

0    NaN
1    NaN
2    1.5
3    2.5
4    2.5
5    5.0
dtype: float64

In [114]:
obj3.reindex(index=range(6), method='nearest')

0    1.5
1    1.5
2    1.5
3    2.5
4    5.0
5    5.0
dtype: float64

In [115]:
df = pd.DataFrame(data=np.arange(9).reshape(3,3), index=['a', 'b', 'c'], columns=['Texas', 'Ohio', 'Nevada'])

In [116]:
df

   Texas  Ohio  Nevada
a      0     1       2
b      3     4       5
c      6     7       8

In [117]:
df2 = df.reindex(index=['a', 'b', 'c', 'd']) #Row reindexing

In [118]:
df2

   Texas  Ohio  Nevada
a    0.0   1.0     2.0
b    3.0   4.0     5.0
c    6.0   7.0     8.0
d    NaN   NaN     NaN

In [119]:
df3 = df2.reindex(columns=['Texas', 'Ohio', 'Nevada', 'California'])

In [120]:
df3

   Texas  Ohio  Nevada  California
a    0.0   1.0     2.0         NaN
b    3.0   4.0     5.0         NaN
c    6.0   7.0     8.0         NaN
d    NaN   NaN     NaN         NaN

In [121]:
df3.loc[['a', 'b', 'c'], ['Texas', 'California']]

   Texas  California
a    0.0         NaN
b    3.0         NaN
c    6.0         NaN

*Table 5-3. reindex function arguments*

![reindex function arguments](Img/5.3.png)

In [122]:
df3.loc['d'].fillna(value=np.mean(df['Ohio']))

Texas         4.0
Ohio          4.0
Nevada        4.0
California    4.0
Name: d, dtype: float64

## Dropping Entries from an Axis

In [123]:
ser = pd.Series(data=np.arange(6), index=[chr(i) for i in range(97, 97+6)])

In [124]:
ser

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [125]:
new_ser = ser.drop('c') #Dropping rows with axis=0

In [126]:
new_ser

a    0
b    1
d    3
e    4
f    5
dtype: int32

In [127]:
ser.drop(['d', 'e'])

a    0
b    1
c    2
f    5
dtype: int32

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [131]:
data.drop(['Ohio', 'Utah']).drop(['four'], axis=1) #Dropping columns with axis = 1

          one  two  three
Colorado    4    5      6
New York   12   13     14

In [132]:
data.drop(['two'], inplace=True, axis=1) #inplace -> permenantly

In [133]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

Be careful with the inplace, as it destroys any data that is dropped.

## Indexing, Selection, and Filtering

In [134]:
ser = pd.Series(data=np.arange(5), index=[chr(i) for i in range(97, 97+5)])

In [135]:
ser

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [136]:
ser['d']

3

In [137]:
ser['c':'e']

c    2
d    3
e    4
dtype: int32

In [138]:
ser[2:5]

c    2
d    3
e    4
dtype: int32

In [139]:
ser[['a', 'c', 'd']]

a    0
c    2
d    3
dtype: int32

In [140]:
ser[[1, 3, 4]]

b    1
d    3
e    4
dtype: int32

In [141]:
ser[ser<2]

a    0
b    1
dtype: int32

In [142]:
ser['b':'d'] = np.mean(ser)

In [143]:
ser

a    0.0
b    2.0
c    2.0
d    2.0
e    4.0
dtype: float64

In [144]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [145]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [146]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [147]:
data[['three', 'four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [148]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data[0:1]

      one  two  three  four
Ohio    0    1      2     3

In [150]:
type(data[0:1])

pandas.core.frame.DataFrame

In [151]:
data.loc['Ohio']

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int32

In [152]:
type(data.loc['Ohio'])

pandas.core.series.Series

In [153]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [154]:
data[data < 6] = 0

In [155]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [156]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [157]:
data.loc['Colorado', ['two','three']]

two      0
three    6
Name: Colorado, dtype: int32

In [158]:
data.iloc[1, [1, 2]]

two      0
three    6
Name: Colorado, dtype: int32

In [159]:
data.iloc[-1]

one      12
two      13
three    14
four     15
Name: New York, dtype: int32

In [160]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
data.iloc[[1,2], [0,1,3]]

          one  two  four
Colorado    0    0     7
Utah        8    9    11

In [162]:
data.loc[:'Utah', 'one':'three']

          one  two  three
Ohio        0    0      0
Colorado    0    0      6
Utah        8    9     10

In [163]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [164]:
data.at['Utah', 'three']

10

In [165]:
data.iat[3,1]

13

*See Table 5-4. Indexing options with DataFrame*

![Indexing options with DataFrame](Img/5.4a.png)

![Indexing options with DataFrame](Img/5.4b.png)

## Integer Indexes

In [166]:
ser = pd.Series(np.arange(5.0))

In [167]:
ser

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [168]:
"ser[-1]" #KeyError

'ser[-1]'

Inferring what the user wants (label-based indexing or position-based) is difficult

On the other hand, with a non-integer index, there is no potential for ambiguity

In [169]:
ser2 = pd.Series(np.arange(5.0), index=['a', 'b', 'c', 'd', 'e'])

In [170]:
ser2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [171]:
ser2[-1]

4.0

In [172]:
# Labels can be negative integer

In [173]:
ser[:1] #Integer based

0    0.0
dtype: float64

In [174]:
ser.loc[:1] #Label based

0    0.0
1    1.0
dtype: float64

In [175]:
ser.iloc[:1] #Integer based

0    0.0
dtype: float64

## Arithmetic and Data Alignment

In [176]:
s1 = pd.Series(data=np.arange(4), index=['a', 'b', 'c', 'e'])

In [177]:
s2 = pd.Series(data=np.arange(6,10), index=['c', 'b', 'g', 'f'])

In [178]:
s1

a    0
b    1
c    2
e    3
dtype: int32

In [179]:
s2

c    6
b    7
g    8
f    9
dtype: int32

In [180]:
s1 + s2

a    NaN
b    8.0
c    8.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [181]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [182]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [183]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [184]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
df1 + df2 #Consider it as outer join in SQL

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [186]:
df1 = pd.DataFrame({'A': [1, 2]})

In [187]:
df1

   A
0  1
1  2

In [188]:
df2 = pd.DataFrame({'B': [3, 4]})

In [189]:
df2

   B
0  3
1  4

In [190]:
df1 * df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

In [191]:
df1 = pd.DataFrame(data=np.arange(12).reshape(3,4), columns=list('abcd'))

In [192]:
df2 = pd.DataFrame(data=np.arange(20).reshape(4,5), columns=list('abcde'))

In [193]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [194]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [195]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [196]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [197]:
df1.multiply(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

In [198]:
#df2['a'] = df1['a'] + df2['a']

In [199]:
#df2

In [200]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [201]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [202]:
df1 = df1.reindex(columns=df2.columns, fill_value=0)

In [203]:
df1

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [204]:
df1 = df1.reindex(index=df2.index, fill_value=0)

In [205]:
df1

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0
3  0  0   0   0  0

In [206]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [207]:
df1.pow(df2)

            a           b          c          d  e
0           1           1          4         27  0
1        1024       15625     279936    5764801  0
2  1073741824  1316288537 -727379968 -234981317  0
3           0           0          0          0  0

In [208]:
df2.pow(df1)

           a           b           c           d  e
0          1           1           4          27  1
1        625        7776      117649     2097152  1
2  100000000 -1937019605  1787822080  1159031605  1
3          1           1           1           1  1

*See Table 5-5. Flexible arithmetic methods*

![Flexible arithmetic methods](Img/5.5.png)

### Operations between DataFrame and Series

In [209]:
arr = np.arange(12).reshape(3,4)

In [210]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [211]:
arr[0]

array([0, 1, 2, 3])

In [212]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

When we subtract arr[0] from arr, the subtraction is performed once for each row.
This is referred to as broadcasting

In [213]:
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=list('abcd'), index=['NY', 'Colorado', 'Utah'])

In [214]:
df

          a  b   c   d
NY        0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

In [215]:
ser = df.iloc[0]

In [216]:
ser

a    0
b    1
c    2
d    3
Name: NY, dtype: int32

Index wise operation

In [217]:
df - ser

          a  b  c  d
NY        0  0  0  0
Colorado  4  4  4  4
Utah      8  8  8  8

In [218]:
df + ser

          a   b   c   d
NY        0   2   4   6
Colorado  4   6   8  10
Utah      8  10  12  14

In [219]:
ser2 = pd.Series(range(3), index=list('abc'))

In [220]:
ser2

a    0
b    1
c    2
dtype: int64

In [221]:
df + ser2

            a     b     c   d
NY        0.0   2.0   4.0 NaN
Colorado  4.0   6.0   8.0 NaN
Utah      8.0  10.0  12.0 NaN

In [222]:
ser3 = df['d']

In [223]:
ser3

NY           3
Colorado     7
Utah        11
Name: d, dtype: int32

In [224]:
df.sub(ser3, axis=0)

          a  b  c  d
NY       -3 -2 -1  0
Colorado -3 -2 -1  0
Utah     -3 -2 -1  0

In [225]:
df

          a  b   c   d
NY        0  1   2   3
Colorado  4  5   6   7
Utah      8  9  10  11

The axis number that you pass is the axis to match on. In this case we mean to match
on the DataFrame’s row index (axis='index' or axis=0) and broadcast across

## Function Application and Mapping

In [226]:
df = pd.DataFrame(data=np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [227]:
df

               b         d         e
Utah   -0.895386 -0.318463  0.181280
Ohio   -1.263780  0.535541 -0.301958
Texas   0.832283  1.076759 -0.720692
Oregon -2.139914  0.323018  0.204882

In [228]:
np.abs(df)

               b         d         e
Utah    0.895386  0.318463  0.181280
Ohio    1.263780  0.535541  0.301958
Texas   0.832283  1.076759  0.720692
Oregon  2.139914  0.323018  0.204882

In [229]:
f = lambda x: x.max() - x.min()

In [230]:
df.apply(f)

b    2.972197
d    1.395223
e    0.925575
dtype: float64

In [231]:
df.apply(f, axis=1)

Utah      1.076665
Ohio      1.799321
Texas     1.797452
Oregon    2.462932
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

In [232]:
def f(x):
    return pd.Series([x.min(), x.max(), x.count()], index=['min', 'max', 'count'])

In [233]:
df.apply(f)

              b         d         e
min   -2.139914 -0.318463 -0.720692
max    0.832283  1.076759  0.204882
count  4.000000  4.000000  4.000000

In [234]:
df

               b         d         e
Utah   -0.895386 -0.318463  0.181280
Ohio   -1.263780  0.535541 -0.301958
Texas   0.832283  1.076759 -0.720692
Oregon -2.139914  0.323018  0.204882

apply() is used for applyng row wise or column wise function, applymap() is used for applying element wise function

In [235]:
t = lambda x: "%.2f" % x

In [236]:
df.applymap(t)

            b      d      e
Utah    -0.90  -0.32   0.18
Ohio    -1.26   0.54  -0.30
Texas    0.83   1.08  -0.72
Oregon  -2.14   0.32   0.20

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [237]:
df['b'].map(t)

Utah      -0.90
Ohio      -1.26
Texas      0.83
Oregon    -2.14
Name: b, dtype: object

## Sorting and Ranking

In [238]:
obj = pd.Series(data=range(5), index=list('dcbae'))

In [239]:
obj

d    0
c    1
b    2
a    3
e    4
dtype: int64

In [240]:
obj.sort_index() #Labels in lexicographically in ascending order

a    3
b    2
c    1
d    0
e    4
dtype: int64

In [241]:
obj.sort_index(ascending=False) #Labels in lexicographically in descending order

e    4
d    0
c    1
b    2
a    3
dtype: int64

In [242]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [243]:
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [244]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [245]:
df.sort_index(axis=1).sort_index(axis=0)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [246]:
ser = pd.Series(data=[4, 7, -3, 2])

In [247]:
ser

0    4
1    7
2   -3
3    2
dtype: int64

In [248]:
ser.sort_values() #Sorting values in Ascending order

2   -3
3    2
0    4
1    7
dtype: int64

In [249]:
ser.sort_values(ascending=False) #Sorting values in Descending order

1    7
0    4
3    2
2   -3
dtype: int64

In [250]:
ser = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [251]:
ser

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [252]:
ser.sort_values() #NaN values are sorted to the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [253]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [254]:
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [255]:
df.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [256]:
df.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [257]:
df.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.

In [258]:
obj = pd.Series(data=[5, -1, 7, 8, -9, 0, 5])

In [259]:
obj

0    5
1   -1
2    7
3    8
4   -9
5    0
6    5
dtype: int64

In [260]:
obj.rank()

0    4.5
1    2.0
2    6.0
3    7.0
4    1.0
5    3.0
6    4.5
dtype: float64

In [261]:
obj.rank(method='first')

0    4.0
1    2.0
2    6.0
3    7.0
4    1.0
5    3.0
6    5.0
dtype: float64

In [262]:
obj.rank(ascending=False, method='max') #Ranking in descending with method max

0    4.0
1    6.0
2    2.0
3    1.0
4    7.0
5    5.0
6    4.0
dtype: float64

In [263]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [264]:
df

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [265]:
df.rank() #rank with axis=0

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [266]:
df.rank(axis=1) #rank with axis=1

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

*Table 5-6. Tie-breaking methods with rank*

![Tie-breaking methods with rank](Img/5.6.png)

## Axis Indexes with Duplicate Labels

In [267]:
ser= pd.Series(data=[1, 1, 2, 3, 4], index=['a', 'b', 'c', 'd', 'a'])

In [268]:
ser

a    1
b    1
c    2
d    3
a    4
dtype: int64

In [269]:
ser.index.is_unique

False

In [270]:
ser['a']

a    1
a    4
dtype: int64

In [271]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [272]:
df

          0         1         2
a  0.128667  0.412111  2.030198
a -0.060195 -0.164366 -2.322506
b  0.353368 -1.161769  1.656438
b -0.462992  0.645102 -0.357391

In [273]:
df.loc['b']

          0         1         2
b  0.353368 -1.161769  1.656438
b -0.462992  0.645102 -0.357391

# 5.3 Summarizing and Computing Descriptive Statistics

In [274]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [275]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [280]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [287]:
df.sum(axis=1, skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

*See Table 5-7 for a list of common options for each reduction method.*

![ Options for reduction methods](Img/5.7.png)

In [288]:
df.idxmin()

one    d
two    b
dtype: object

In [289]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [292]:
df.idxmax()

one    b
two    d
dtype: object

In [293]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [294]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [297]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [298]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [302]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [304]:
obj = pd.Series(data=['a', 'a', 'b', 'c']*5) #for non numerical data describe() act as:

In [305]:
obj.describe()

count     20
unique     3
top        a
freq      10
dtype: object

In [311]:
df = pd.DataFrame(data=np.random.randn(100,10), columns=list('abcdefghij'))

In [312]:
df

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-1.568956,0.598102,-2.428103,0.326191,0.789642,2.009820,0.918965,-0.247935,0.397853
1,-1.941784,0.517815,0.774958,0.436089,0.605031,-1.369003,2.796618,-1.646646,1.109075,2.083686
2,-1.154346,-0.610974,-0.452133,-0.432582,0.540353,0.390373,0.654752,1.321858,1.255792,2.115926
3,1.583237,0.217573,-1.813533,0.193869,-0.810564,0.165017,-0.286152,0.055525,-0.264580,0.145364
4,-1.092491,-1.014941,-0.468430,-0.749819,0.063463,-0.668255,-0.871019,0.742001,-0.030268,0.241634
...,...,...,...,...,...,...,...,...,...,...
95,1.773753,0.953194,0.935450,-0.037146,0.805790,0.956099,-1.421737,-0.353980,1.082165,0.505167
96,0.075754,0.322867,-0.192907,-0.301989,-1.771029,0.262599,-0.165360,-0.929787,1.052576,-0.051959
97,-0.676642,0.753944,-0.011623,-0.987969,-0.030230,2.387670,0.734373,0.125506,0.943879,0.309224
98,0.809674,0.108535,-0.904784,-1.079468,-0.014772,0.459301,0.765961,0.150294,-2.037502,0.662913
99,-0.863473,0.043974,-2.473517,0.867793,0.786250,0.305067,1.341847,-1.013861,-0.364802,2.081979

In [313]:
df.head()

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-1.568956,0.598102,-2.428103,0.326191,0.789642,2.009820,0.918965,-0.247935,0.397853
1,-1.941784,0.517815,0.774958,0.436089,0.605031,-1.369003,2.796618,-1.646646,1.109075,2.083686
2,-1.154346,-0.610974,-0.452133,-0.432582,0.540353,0.390373,0.654752,1.321858,1.255792,2.115926
3,1.583237,0.217573,-1.813533,0.193869,-0.810564,0.165017,-0.286152,0.055525,-0.264580,0.145364
4,-1.092491,-1.014941,-0.468430,-0.749819,0.063463,-0.668255,-0.871019,0.742001,-0.030268,0.241634

In [314]:
df.tail()

,a,b,c,d,e,f,g,h,i,j
95,1.773753,0.953194,0.935450,-0.037146,0.805790,0.956099,-1.421737,-0.353980,1.082165,0.505167
96,0.075754,0.322867,-0.192907,-0.301989,-1.771029,0.262599,-0.165360,-0.929787,1.052576,-0.051959
97,-0.676642,0.753944,-0.011623,-0.987969,-0.030230,2.387670,0.734373,0.125506,0.943879,0.309224
98,0.809674,0.108535,-0.904784,-1.079468,-0.014772,0.459301,0.765961,0.150294,-2.037502,0.662913
99,-0.863473,0.043974,-2.473517,0.867793,0.786250,0.305067,1.341847,-1.013861,-0.364802,2.081979

In [334]:
df.loc[[51, 14, 13, 65, 14, 2],['b', 'c', 'd', 'e', 'f']] = np.nan

In [335]:
df

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-1.568956,0.598102,-2.428103,0.326191,0.789642,2.009820,0.918965,-0.247935,0.397853
1,-1.941784,0.517815,0.774958,0.436089,0.605031,-1.369003,2.796618,-1.646646,1.109075,2.083686
2,-1.154346,NaN,NaN,NaN,NaN,NaN,0.654752,1.321858,1.255792,2.115926
3,1.583237,0.217573,-1.813533,0.193869,-0.810564,0.165017,-0.286152,0.055525,-0.264580,0.145364
4,-1.092491,-1.014941,-0.468430,-0.749819,0.063463,-0.668255,-0.871019,0.742001,-0.030268,0.241634
...,...,...,...,...,...,...,...,...,...,...
95,1.773753,0.953194,0.935450,-0.037146,0.805790,0.956099,-1.421737,-0.353980,1.082165,0.505167
96,0.075754,0.322867,-0.192907,-0.301989,-1.771029,0.262599,-0.165360,-0.929787,1.052576,-0.051959
97,-0.676642,0.753944,-0.011623,-0.987969,-0.030230,2.387670,0.734373,0.125506,0.943879,0.309224
98,0.809674,0.108535,-0.904784,-1.079468,-0.014772,0.459301,0.765961,0.150294,-2.037502,0.662913
99,-0.863473,0.043974,-2.473517,0.867793,0.786250,0.305067,1.341847,-1.013861,-0.364802,2.081979

In [336]:
df.describe()

,a,b,c,d,e,f,g,h,i,j
count,100.000000,95.000000,95.000000,95.000000,95.000000,95.000000,100.000000,100.000000,100.000000,100.000000
mean,-0.134994,-0.019889,0.041092,0.039076,-0.090519,0.026217,0.279246,-0.129825,-0.037134,0.263725
std,1.108084,1.005800,1.027849,1.024085,1.005545,0.896657,1.074393,0.983079,1.032741,1.078360
min,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492
25%,-1.086736,-0.657019,-0.515079,-0.607814,-0.823327,-0.571648,-0.418477,-0.751788,-0.831309,-0.318472
50%,-0.079914,0.087229,-0.062840,0.035728,0.034456,0.103440,0.233267,-0.076039,-0.069313,0.349620
75%,0.624220,0.680692,0.937930,0.711730,0.586159,0.635592,0.768834,0.626866,0.789108,0.909296
max,1.983725,2.722492,2.109813,2.553685,3.605420,2.387670,2.833543,2.336314,2.464460,2.737029

In [337]:
df.count()

a    100
b     95
c     95
d     95
e     95
f     95
g    100
h    100
i    100
j    100
dtype: int64

In [339]:
df.shape

(100, 10)

In [340]:
df.min()

a   -2.389524
b   -2.776408
c   -3.127063
d   -2.898707
e   -2.598067
f   -2.737292
g   -1.860319
h   -2.606586
i   -2.131337
j   -2.645492
dtype: float64

In [341]:
df.max()

a    1.983725
b    2.722492
c    2.109813
d    2.553685
e    3.605420
f    2.387670
g    2.833543
h    2.336314
i    2.464460
j    2.737029
dtype: float64

In [350]:
df.idxmax()

a    88
b    80
c    61
d    20
e     7
f    97
g    53
h    16
i    28
j    42
dtype: int64

In [353]:
df.idxmin()

a    66
b    12
c    68
d    46
e    88
f    61
g    80
h     6
i    21
j    28
dtype: int64

In [354]:
df.quantile() #Compute sample quantile ranging from 0 to 1

a   -0.079914
b    0.087229
c   -0.062840
d    0.035728
e    0.034456
f    0.103440
g    0.233267
h   -0.076039
i   -0.069313
j    0.349620
Name: 0.5, dtype: float64

In [355]:
df.sum()

a   -13.499379
b    -1.889490
c     3.903774
d     3.712220
e    -8.599267
f     2.490625
g    27.924597
h   -12.982547
i    -3.713405
j    26.372496
dtype: float64

In [356]:
df.mean()

a   -0.134994
b   -0.019889
c    0.041092
d    0.039076
e   -0.090519
f    0.026217
g    0.279246
h   -0.129825
i   -0.037134
j    0.263725
dtype: float64

In [357]:
df.median() #Arithmetic median (50% quantile) of values

a   -0.079914
b    0.087229
c   -0.062840
d    0.035728
e    0.034456
f    0.103440
g    0.233267
h   -0.076039
i   -0.069313
j    0.349620
dtype: float64

In [358]:
df.mad() #Mean absolute deviation from mean value

a    0.909514
b    0.780293
c    0.814326
d    0.800573
e    0.792196
f    0.707636
g    0.828118
h    0.785722
i    0.866906
j    0.825976
dtype: float64

In [362]:
df.prod() #Product of all values

a    1.567508e-23
b    3.641771e-30
c   -3.913996e-27
d   -1.429417e-26
e   -7.309486e-29
f    5.349319e-32
g    1.179781e-24
h   -1.408702e-29
i   -2.925217e-22
j   -1.833297e-25
dtype: float64

In [363]:
df.var() #Sample variance of values

a    1.227851
b    1.011633
c    1.056473
d    1.048750
e    1.011121
f    0.803994
g    1.154320
h    0.966445
i    1.066554
j    1.162860
dtype: float64

In [364]:
df.std() #Sample standard deviation of values

a    1.108084
b    1.005800
c    1.027849
d    1.024085
e    1.005545
f    0.896657
g    1.074393
h    0.983079
i    1.032741
j    1.078360
dtype: float64

In [365]:
df.skew() #Sample skewness (third moment) of values

a    0.011076
b   -0.203432
c   -0.375916
d   -0.223858
e    0.314679
f   -0.370248
g    0.534874
h   -0.295179
i    0.216287
j   -0.257212
dtype: float64

In [366]:
df.kurt() #Sample kurtosis (fourth moment) of values

a   -0.804833
b    0.225841
c    0.105136
d    0.419242
e    0.946414
f    0.493174
g   -0.030478
h   -0.093396
i   -0.611554
j    0.027585
dtype: float64

In [369]:
df.cumsum(axis=1)

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-2.039773,-1.441671,-3.869774,-3.543583,-2.753942,-0.744121,0.174844,-0.073091,0.324762
1,-1.941784,-1.423970,-0.649012,-0.212923,0.392108,-0.976895,1.819723,0.173077,1.282151,3.365838
2,-1.154346,NaN,NaN,NaN,NaN,NaN,-0.499594,0.822265,2.078057,4.193983
3,1.583237,1.800809,-0.012724,0.181146,-0.629418,-0.464401,-0.750553,-0.695028,-0.959608,-0.814244
4,-1.092491,-2.107432,-2.575862,-3.325680,-3.262217,-3.930472,-4.801491,-4.059490,-4.089758,-3.848125
...,...,...,...,...,...,...,...,...,...,...
95,1.773753,2.726948,3.662398,3.625252,4.431042,5.387141,3.965405,3.611424,4.693589,5.198756
96,0.075754,0.398621,0.205714,-0.096275,-1.867304,-1.604705,-1.770065,-2.699852,-1.647277,-1.699236
97,-0.676642,0.077301,0.065679,-0.922291,-0.952521,1.435148,2.169522,2.295028,3.238908,3.548131
98,0.809674,0.918209,0.013425,-1.066043,-1.080814,-0.621513,0.144448,0.294742,-1.742760,-1.079847
99,-0.863473,-0.819499,-3.293016,-2.425224,-1.638974,-1.333907,0.007940,-1.005921,-1.370723,0.711256

In [376]:
df.cummin() #Cumulative minimum of values

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-1.568956,0.598102,-2.428103,0.326191,0.789642,2.009820,0.918965,-0.247935,0.397853
1,-1.941784,-1.568956,0.598102,-2.428103,0.326191,-1.369003,2.009820,-1.646646,-0.247935,0.397853
2,-1.941784,NaN,NaN,NaN,NaN,NaN,0.654752,-1.646646,-0.247935,0.397853
3,-1.941784,-1.568956,-1.813533,-2.428103,-0.810564,-1.369003,-0.286152,-1.646646,-0.264580,0.145364
4,-1.941784,-1.568956,-1.813533,-2.428103,-0.810564,-1.369003,-0.871019,-1.646646,-0.264580,0.145364
...,...,...,...,...,...,...,...,...,...,...
95,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492
96,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492
97,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492
98,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492
99,-2.389524,-2.776408,-3.127063,-2.898707,-2.598067,-2.737292,-1.860319,-2.606586,-2.131337,-2.645492

In [379]:
df.cummax() #Cumulative maximum of values

,a,b,c,d,e,f,g,h,i,j
0,-0.470817,-1.568956,0.598102,-2.428103,0.326191,0.789642,2.009820,0.918965,-0.247935,0.397853
1,-0.470817,0.517815,0.774958,0.436089,0.605031,0.789642,2.796618,0.918965,1.109075,2.083686
2,-0.470817,NaN,NaN,NaN,NaN,NaN,2.796618,1.321858,1.255792,2.115926
3,1.583237,0.517815,0.774958,0.436089,0.605031,0.789642,2.796618,1.321858,1.255792,2.115926
4,1.583237,0.517815,0.774958,0.436089,0.605031,0.789642,2.796618,1.321858,1.255792,2.115926
...,...,...,...,...,...,...,...,...,...,...
95,1.983725,2.722492,2.109813,2.553685,3.605420,1.759801,2.833543,2.336314,2.464460,2.737029
96,1.983725,2.722492,2.109813,2.553685,3.605420,1.759801,2.833543,2.336314,2.464460,2.737029
97,1.983725,2.722492,2.109813,2.553685,3.605420,2.387670,2.833543,2.336314,2.464460,2.737029
98,1.983725,2.722492,2.109813,2.553685,3.605420,2.387670,2.833543,2.336314,2.464460,2.737029
99,1.983725,2.722492,2.109813,2.553685,3.605420,2.387670,2.833543,2.336314,2.464460,2.737029

In [380]:
df.cumprod()

,a,b,c,d,e,f,g,h,i,j
0,-4.708168e-01,-1.568956e+00,5.981018e-01,-2.428103e+00,3.261908e-01,7.896417e-01,2.009820e+00,9.189649e-01,-2.479346e-01,3.978526e-01
1,9.142245e-01,-8.124282e-01,4.635035e-01,-1.058870e+00,1.973554e-01,-1.081022e+00,5.620700e+00,-1.513210e+00,-2.749779e-01,8.289999e-01
2,-1.055331e+00,NaN,NaN,NaN,NaN,NaN,3.680163e+00,-2.000250e+00,-3.453152e-01,1.754103e+00
3,-1.670839e+00,-1.767622e-01,-8.405788e-01,-2.052825e-01,-1.599692e-01,-1.783870e-01,-1.053086e+00,-1.110645e-01,9.136360e-02,2.549826e-01
4,1.825376e+00,1.794032e-01,3.937523e-01,1.539247e-01,-1.015220e-02,1.192079e-01,9.172587e-01,-8.240992e-02,-2.765389e-03,6.161241e-02
...,...,...,...,...,...,...,...,...,...,...
95,4.374093e-22,3.134607e-27,-7.800248e-25,5.114441e-26,1.175525e-25,6.088886e-31,-9.452419e-24,-7.922287e-28,-3.961261e-22,8.267317e-24
96,3.313536e-23,1.012061e-27,1.504723e-25,-1.544506e-26,-2.081888e-25,1.598937e-31,1.563056e-24,7.366039e-28,-4.169527e-22,-4.295633e-25
97,-2.242079e-23,7.630373e-28,-1.748882e-27,1.525924e-26,6.293629e-27,3.817734e-31,1.147867e-24,9.244852e-29,-3.935530e-22,-1.328311e-25
98,-1.815353e-23,8.281662e-29,1.582360e-27,-1.647187e-26,-9.296648e-29,1.753490e-31,8.792219e-25,1.389443e-29,8.018652e-22,-8.805549e-26
99,1.567508e-23,3.641771e-30,-3.913996e-27,-1.429417e-26,-7.309486e-29,5.349319e-32,1.179781e-24,-1.408702e-29,-2.925217e-22,-1.833297e-25

In [381]:
df.diff() #Compute first arithmetic difference (useful for time series)

,a,b,c,d,e,f,g,h,i,j
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,-1.470967,2.086770,0.176856,2.864193,0.278840,-2.158644,0.786798,-2.565611,1.357009,1.685834
2,0.787438,NaN,NaN,NaN,NaN,NaN,-2.141866,2.968505,0.146718,0.032240
3,2.737582,NaN,NaN,NaN,NaN,NaN,-0.940904,-1.266333,-1.520373,-1.970563
4,-2.675728,-1.232513,1.345103,-0.943688,0.874027,-0.833272,-0.584867,0.686475,0.234312,0.096270
...,...,...,...,...,...,...,...,...,...,...
95,0.548181,2.845465,-0.699168,0.568608,1.094420,0.852659,-1.967989,-0.046981,-1.330150,0.431956
96,-1.698000,-0.630327,-1.128357,-0.264844,-2.576818,-0.693500,1.256376,-0.575807,-0.029590,-0.557126
97,-0.752396,0.431077,0.181284,-0.685980,1.740798,2.125070,0.899734,1.055293,-0.108696,0.361183
98,1.486316,-0.645408,-0.893161,-0.091499,0.015459,-1.928368,0.031588,0.024787,-2.981382,0.353689
99,-1.673147,-0.064562,-1.568733,1.947261,0.801021,-0.154234,0.575885,-1.164155,1.672701,1.419066

In [382]:
df.pct_change() #Compute percent changes

,a,b,c,d,e,f,g,h,i,j
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,3.124288,-1.330038,0.295695,-1.179601,0.854836,-2.733701,0.391477,-2.791849,-5.473255,4.237333
2,-0.405523,0.000000,0.000000,0.000000,0.000000,0.000000,-0.765877,-1.802758,0.132289,0.015472
3,-2.371545,-0.579825,-3.340171,-0.555436,-2.339707,-1.120538,-1.437039,-0.957995,-1.210688,-0.931300
4,-1.690036,-5.664834,-0.741703,-4.867648,-1.078295,-5.049611,2.043903,12.363285,-0.885600,0.662271
...,...,...,...,...,...,...,...,...,...,...
95,0.447286,-1.503730,-0.427726,-0.938679,-3.791773,8.243058,-3.602709,0.153033,-0.551400,5.900151
96,-0.957292,-0.661279,-1.206218,7.129881,-3.197879,-0.725343,-0.883691,1.626664,-0.027343,-1.102856
97,-9.932141,1.335152,-0.939750,2.271540,-0.982931,8.092444,-5.441046,-1.134984,-0.103267,-6.951276
98,-2.196605,-0.856043,76.846802,0.092613,-0.511368,-0.807636,0.043014,0.197498,-3.158647,1.143798
99,-2.066445,-0.594843,1.733821,-1.803908,-54.227390,-0.335802,0.751846,-7.745864,-0.820956,2.140651

*See Table 5-8 for a full list of summary statistics and related methods.*

![Table 5-8. Descriptive and summary statistics](Img/5.8.png)

## Correlation and Covariance

In [383]:
import pandas_datareader.data as web

C:\Users\ABC\anaconda3\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [386]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [397]:
price = pd.DataFrame(data={ticker: data['Adj Close'] for ticker, data in all_data.items()})

In [399]:
volume = pd.DataFrame(data={ticker: data['Volume'] for ticker, data in all_data.items()})

In [409]:
price.head()

                  AAPL         IBM       MSFT        GOOG
Date
2015-05-27  121.689232  138.392303  43.088200  539.789978
2015-05-28  121.449577  138.158981  42.943398  539.780029
2015-05-29  120.067184  136.501480  42.409435  532.109985
2015-06-01  120.306801  136.927917  42.744289  533.989990
2015-06-02  119.772255  136.501480  42.463726  539.179993

In [410]:
volume.head()

                  AAPL        IBM        MSFT     GOOG
Date
2015-05-27  45833200.0  2764400.0  27335600.0  1525000
2015-05-28  30733300.0  1731400.0  19283700.0  1029800
2015-05-29  50884500.0  4092000.0  36519600.0  2597400
2015-06-01  32112800.0  2985500.0  28837300.0  1904300
2015-06-02  33667600.0  2571400.0  21498300.0  1939000

In [411]:
returns = price.pct_change()

In [412]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-05-18  0.023561  0.039152  0.009554  0.007828
2020-05-19 -0.005778 -0.010447 -0.006922 -0.007554
2020-05-20  0.019448  0.009061  0.013871  0.024198
2020-05-21 -0.007455 -0.018619 -0.012011 -0.002787
2020-05-22  0.006438 -0.006128  0.000436  0.005432

In [416]:
returns['MSFT'].corr(returns['GOOG'])

0.7512330973991518

In [417]:
returns['MSFT'].cov(returns['GOOG'])

0.00022133367447461325

In [419]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.533508  0.711159  0.642455
IBM   0.533508  1.000000  0.599897  0.529341
MSFT  0.711159  0.599897  1.000000  0.751233
GOOG  0.642455  0.529341  0.751233  1.000000

In [420]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000328  0.000152  0.000222  0.000199
IBM   0.000152  0.000248  0.000163  0.000143
MSFT  0.000222  0.000163  0.000296  0.000221
GOOG  0.000199  0.000143  0.000221  0.000293

In [421]:
returns.corrwith(returns['IBM'])

AAPL    0.533508
IBM     1.000000
MSFT    0.599897
GOOG    0.529341
dtype: float64

## Unique Values, Value Counts, and Membership

In [422]:
obj = pd.Series(data=['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [423]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [442]:
obj.value_counts(sort=False)

a    3
d    1
c    3
b    2
dtype: int64

In [485]:
mask = obj.isin(['b', 'c'])

In [486]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [487]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [489]:
to_match = pd.Series(['c', 'a', 'a', 'd', 'd','a', 'e'])

In [490]:
uniq_values = pd.Series(['c', 'd', 'a'])

In [492]:
pd.Index(uniq_values).get_indexer(to_match)

array([ 0,  2,  2,  1,  1,  2, -1], dtype=int64)

*See Table 5-9 for a reference on these methods.*

![Unique, value counts, and set membership methods](Img/5.9.png)

In [493]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [494]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [495]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

Here, the row labels in the result are the distinct values occurring in all of the columns. The values are the respective counts of these values in each column.